namespace ReplaceIncorrectSeparators
{
    internal class Program
    {
        public static void Main(string[] args)
        {
            var citiesPopulation =
                "Страна Население Дата %\nКитай: 1405023000; 24.08.2020; 17.99%\nИндия: 1375100000 24.08.2020 17.6%\nСША: 329957441; 15.07.2020; 4.24%\nИндонезия 266911900; 01.07.2019 3.42%\nПакистан - 218647040 24.08.2020; 2.8%\nБразилия 211950300; 24.08.2020; 2.71%\nНигерия 208426036; 24.08.2020; 2.67%\nБангладеш 171147762 24.08.2020; 2.19%\nРоссия: 146748590; 01.01.2020 1.88%\nМексика - 127792286, 01.07.2020, 1.64%\nЯпония 125950000; 01.03.2020, 1.61%\nЭфиопия 112079000, 01.07.2019 1.43%\nФилиппины 108968790, 24.08.2020; 1.39%\nЕгипет 100812120, 24.08.2020 1.29%\nВьетнам 96208984; 01.04.2019; 1.23%\nДРК 86791000, 01.07.2019, 1.11%\nИран 84393386 24.08.2020 1.08%\nТурция - 83154997 1.01.2020 1.06%\nГермания - 83149300 1.10.2019 1.06%\nФранция - 68859599; 01.01.2018, 0.88%";
            Console.WriteLine(ReplaceIncorrectSeparators(citiesPopulation));
        }

        public static string ReplaceIncorrectSeparators(string text) => string
            .Join("\t", text.Split(
                new[] { " ", ":", "-", ",", ";" },
                int.MaxValue,
                StringSplitOptions.RemoveEmptyEntries
            ));
    }
}